PulseRain/Arduino_RISCV_IDE/PulseRain_RISCV/Reindeer/boards.txt
############################################################
# PulseRain RISC V
############################################################


UPDuinoV2.name=PulseRain Reindeer - Gnarly Grey UPDuinoV2 Board (Lattice UP5K)
UPDuinoV2.compiler.ld.extra_flags=--section-start=.init=0x80000000
UPDuinoV2.build.variant=generic
UPDuinoV2.build.board=_BOARD_PULSERAIN_REINDEER_UPDUINO_V2_
UPDuinoV2.build.sdata.size=65536

UPDuinoV2.ldscript=Reindeer.ld

UPDuinoV2.upload.protocol=UART
UPDuinoV2.upload.maximum_size=32768
UPDuinoV2.upload.maximum_data_size=8192
UPDuinoV2.upload.speed=115200
UPDuinoV2.upload.tool=Reindeer_upload



STEP.name=STEP CYC10 Board (Intel 10CL016YU256C8G)

STEP.platform=Reindeer
STEP.build.board=_BOARD_STEP_CYC10_

STEP.build.extra_flags = -march=rv32i -mabi=ilp32 
STEP.compiler.c.extra_flags= 
STEP.compiler.cpp.extra_flags= 
STEP.ld.extra_flags = 


STEP.upload.maximum_size=8388608
STEP.upload.speed=921600
STEP.upload.tool=Reindeer_upload

STEP.build.mcu=Reindeer
STEP.build.core=Reindeer
STEP.build.variant=generic



BLADERF.name=STEP CYC10 Board (Intel 10CL016YU256C8G)

BLADERF.platform=Nuand bladeRF
BLADERF.build.board=_BOARD_BLADERF_

BLADERF.build.extra_flags = -march=rv32i -mabi=ilp32 
BLADERF.compiler.c.extra_flags= 
BLADERF.compiler.cpp.extra_flags= 
BLADERF.ld.extra_flags = 

BLADERF.upload.maximum_size=131072
BLADERF.upload.speed=115200
BLADERF.upload.tool=Reindeer_upload

BLADERF.build.mcu=Reindeer
BLADERF.build.core=Reindeer
BLADERF.build.variant=generic



TRION.name=Efinix Trion T20 BGA256 Development Kit

TRION.platform=Reindeer
TRION.build.board=_BOARD_TRION_T20_

TRION.build.extra_flags = -march=rv32i -mabi=ilp32
TRION.compiler.c.extra_flags= 
TRION.compiler.cpp.extra_flags= 
TRION.ld.extra_flags = 


TRION.upload.maximum_size=49152
TRION.upload.speed=921600
TRION.upload.tool=Reindeer_upload

TRION.build.mcu=Reindeer
TRION.build.core=Reindeer
TRION.build.variant=generic

